{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day"
        ],
        "responses": [
          "Hey :-)",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?"
        ]
      },
      {
        "tag": "funny",
        "patterns": [
          "Tell me a joke!",
          "Tell me something funny!",
          "Do you know a joke?"
        ],
        "responses": [
          "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
          "What did the buffalo say when his son left for college? Bison."
        ]
      },
      {
        "tag": "mental_health",
        "patterns": [
          "I'm feeling anxious",
          "I feel stressed out",
          "I'm having trouble sleeping",
          "I'm feeling down",
          "I think I might be depressed",
          "How do I cope with stress?",
          "What can I do to relax?"
        ],
        "responses": [
          "It's important to acknowledge your feelings. Have you tried deep breathing exercises?",
          "Remember to take breaks and practice self-care. Is there a hobby you enjoy?",
          "Talking to a trusted friend or professional can help. Would you like to discuss your feelings?",
          "Prioritize sleep and establish a bedtime routine. Avoid screens before bed.",
          "It's okay to seek help. Consider talking to a therapist or counselor.",
          "Engage in activities that bring you joy. What are some things you used to enjoy?"
        ]
      },
      {
        "tag": "self_care",
        "patterns": [
          "How can I practice self-care?",
          "What are self-care activities?",
          "Why is self-care important?"
        ],
        "responses": [
          "Self-care involves activities that promote well-being, such as meditation, exercise, and spending time in nature.",
          "Self-care is essential for maintaining mental and emotional health. It helps reduce stress and prevent burnout.",
          "Take time for yourself regularly. Prioritize activities that nourish your mind, body, and soul."
        ]
      },
      {
        "tag": "therapy_options",
        "patterns": [
          "Where can I find therapy?",
          "How do I choose a therapist?",
          "What are my therapy options?"
        ],
        "responses": [
          "You can find therapists through online directories or referrals from your doctor.",
          "Choosing a therapist involves considering their expertise, approach, and compatibility with your needs.",
          "Therapy options include individual counseling, group therapy, and online therapy platforms."
        ]
      }
    ]
  }
  